ZigaMahne/STM32H7RSxx_DFP/CMSIS/Flash/STM32H7S78_DK_OSPI/OSPI/STM32H7RSOSPI.c
/**
  ******************************************************************************
  * @file    STM32H7RSOSPI.c
  * @author  MCD Application Team
  * @brief   This file defines the operations of the external loader for
  *          MX66UW1G45G OSPI memory of STM32H7S78-DK.
  *           
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#include "STM32H7RSOSPI.h"

/* Exported variables --------------------------------------------------------*/
/** @addtogroup STM32H7S78_DK_XSPI_NOR_Exported_Variables
  * @{
  */
XSPI_HandleTypeDef hxspi_nor[XSPI_NOR_INSTANCES_NUMBER] = {0};
XSPI_NOR_Ctx_t XSPI_Nor_Ctx[XSPI_NOR_INSTANCES_NUMBER]  = {{
    XSPI_ACCESS_NONE,
    MX66UW1G45G_SPI_MODE,
    MX66UW1G45G_STR_TRANSFER
  }
};

BSP_XSPI_NOR_Init_t Flash;

/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32H7S78_DK_XSPI_NOR_Private_Functions XSPI_NOR Private Functions
  * @{
  */

void HAL_Delay(uint32_t Delay)
{
  int i=0;
  for (i=0; i<0x1000; i++);
}
/** @defgroup STM32H7S78_DK_OSPI_Exported_Functions Exported Functions
  * @{
  */

 /**
  * @brief  Initializes the OSPI interface.
  * @param  Instance   OSPI Instance
  * @param  Init       OSPI Init structure
  * @retval BSP status
  */
 HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{ 
  return HAL_OK;
}
/**
  * @brief  System initialization.
  * @param  None
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */
int Init_OSPI()
{  
	/*disable interrupts*/
__disable_irq();

  /* Zero Init structs */
 memset(&Flash,0,sizeof(Flash));
  SystemInit(); 
	 
  Flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
   Flash.TransferRate  = BSP_XSPI_NOR_STR_TRANSFER;
  /* Configure the system clock  */
   SystemClock_Config();
	
/*Initialaize OSPI*/
   if(BSP_XSPI_NOR_Init(0,&Flash) !=0)
    return 0;

/*Configure the OSPI in memory-mapped mode*/
   if(BSP_XSPI_NOR_EnableMemoryMappedMode(0)!=0)  
				return 0;

   return 1;
}

/**
  * @brief   erase memory.
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */

 int MassErase (void){
	 
 /*Initialaize OSPI*/
	 if(BSP_XSPI_NOR_DeInit(0) !=0)
    return 0;

  if(BSP_XSPI_NOR_Init(0,&Flash) !=0)
    return 0;
	 
	 /*Erases the entire OSPI memory*/
	 if(BSP_XSPI_NOR_Erase_Chip(0)!=0)
		 return 0;

  /*Reads current status of the OSPI memory*/
	while (BSP_XSPI_NOR_GetStatus(0)!=0){};

	 return 1;
 
 }
 
 /**
  * @brief   Program memory.
  * @param   Address: page address
  * @param   Size   : size of data
  * @param   buffer : pointer to data buffer
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */
 int Write (uint32_t Address, uint32_t Size, uint8_t* buffer)
{
    /*Initialaize OSPI*/
  Address = Address & 0x0fffffff; 
	if(BSP_XSPI_NOR_DeInit(0) !=0)
    return 0;
  
  if(BSP_XSPI_NOR_Init(0,&Flash) !=0)
    return 0;
	
	 /*Writes data to the OSPI memory*/
    if(BSP_XSPI_NOR_Write(0,buffer,Address, Size)!=0)
			return 0;
  
   return 1;
}


/**
  * @brief   Sector erase.
  * @param   EraseStartAddress :  erase start address
  * @param   EraseEndAddress   :  erase end address
	* @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */
 int SectorErase (uint32_t EraseStartAddress ,uint32_t EraseEndAddress)
{
	
  uint32_t BlockAddr;
  EraseStartAddress &= 0x0FFFFFFF;  
  EraseEndAddress &= 0x0FFFFFFF;
  EraseStartAddress = EraseStartAddress -  EraseStartAddress % 0x10000;

	/*Initialaize OSPI*/
	 if(BSP_XSPI_NOR_DeInit(0) !=0)
    return 0;

 if(BSP_XSPI_NOR_Init(0,&Flash) !=0)
    return 0;

	
	  while (EraseEndAddress>EraseStartAddress)
  {
    BlockAddr = EraseStartAddress;
  /*Erases the specified block of the OSPI memory*/
  if(BSP_XSPI_NOR_Erase_Block(0,BlockAddr, MX66UW1G45G_ERASE_64K )!=0)
		return 0;
 
   /*Reads current status of the OSPI memory*/
		while (BSP_XSPI_NOR_GetStatus(0)!=0);
		EraseStartAddress+=0x10000;
   
  }
if(BSP_XSPI_NOR_EnableMemoryMappedMode(0)!=0)
				return 0;
 
  return 1;	
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follows :
  *            System Clock source            = PLL (MSI)
  *            SYSCLK(Hz)                     = 160000000
  *            HCLK(Hz)                       = 160000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            APB3 Prescaler                 = 1
  *            MSI Frequency(Hz)              = 4000000
  *            PLL_MBOOST                     = 1
  *            PLL_M                          = 1
  *            PLL_N                          = 80
  *            PLL_Q                          = 2
  *            PLL_R                          = 2
  *            PLL_P                          = 2
  *            Flash Latency(WS)              = 4
  * @param  None
  * @retval None
  */
 int SystemClock_Config(void)
{
 RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  /* Configure the system Power Supply */
  if (HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY) != HAL_OK)
  {
    /* Initialization error */
    while(1);
  }


  /* Enable voltage range 1 for VOS High level */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    /* Initialization error */
    while(1);
  }

  /* Activate PLL1 with HSI as source (HSI is ON at reset) */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 16;
  RCC_OscInitStruct.PLL1.PLLN = 64; /* PLL1 VCO = 64/4 * 60 = 960MHz */
  RCC_OscInitStruct.PLL1.PLLP = 2;  /* PLL1 P =480MHz */
  RCC_OscInitStruct.PLL1.PLLQ = 2;  /* PLL1 Q =480MHz */
  RCC_OscInitStruct.PLL1.PLLR = 2;  /* PLL1 R =480MHz */
  RCC_OscInitStruct.PLL1.PLLS = 2;  /* PLL1 S =480MHz */
  RCC_OscInitStruct.PLL1.PLLT = 2;  /* PLL1 T =480MHz */
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    /* Initialization error */
    while(1);
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1, PCLK2,
     PCLK4 and PCLK5 clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK  | \
                                 RCC_CLOCKTYPE_PCLK1  | RCC_CLOCKTYPE_PCLK2 | \
                                 RCC_CLOCKTYPE_PCLK4  | RCC_CLOCKTYPE_PCLK5);
  RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider  = RCC_SYSCLK_DIV1;   /* System CPU clock=pll1p_ck */
  RCC_ClkInitStruct.AHBCLKDivider  = RCC_HCLK_DIV2;     /* AXI/AHB System bus clock=System CPU clock/2 */
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;     /* APB1 bus clock=System bus clock/4 */
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;     /* APB2 bus clock=System bus clock/4 */
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;     /* APB4 bus clock=System bus clock/4 */
  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV2;     /* APB5 bus clock=System bus clock/4 */
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    /* Initialization error */
    while(1);
  }
  return 1;
}


/**
  * @brief  Initializes the XSPI interface.
  * @param  Instance   XSPI Instance
  * @param  Init       XSPI Init structure
  * @retval BSP status
  */
int32_t BSP_XSPI_NOR_Init(uint32_t Instance, BSP_XSPI_NOR_Init_t *Init)
{
  int32_t ret;
  BSP_XSPI_NOR_Info_t pInfo;
  MX_XSPI_InitTypeDef xspi_init;
  
  memset(&xspi_init, 0, sizeof(xspi_init));
  memset(&hxspi_nor, 0, sizeof(hxspi_nor));
  memset(&XSPI_Nor_Ctx, 0, sizeof(XSPI_Nor_Ctx));
  
